OpenFOAM/case/constant/UDir
horc 0.99756405;
verc 0.069756474;
negverc -0.069756474;
#inputMode merge
