OpenFOAM/case/constant/polyMesh/boundary
FoamFile
{
    version 2.0;
    format ascii;
    class polyBoundaryMesh;
    location "constant/polyMesh";
    object boundary;
}
// * * * * * * * * * * //


3
(
body
{
    type wall;
    nFaces 365;
    startFace 74095;
}
exterior
{
    type patch;
    nFaces 365;
    startFace 74460;
}
sides
{
    type empty;
    nFaces 74460;
    startFace 74825;
}
)


// * * * * * * * * * * //


