OpenFOAM/case/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
#include "../constant/UDir"
forces
{
    type        forceCoeffs;
    functionObjectLibs ( "libforces.so" );
    outputControl timeStep;
    outputInterval 1;

    patches     ( "body" );
    pName       p;
    UName       U;
    rhoName     rhoInf;      // Indicates incompressible
    log         true;
    rhoInf      1;           // Redundant for incompressible
    liftDir     ($negverc $horc 0);
    dragDir     ($horc $verc 0);
    CofR        (0.25 0 0);  // Axle midpoint on ground
    pitchAxis   (0 0 1);
    magUInf     1;
    lRef        1;        // Wheelbase length
    Aref        0.01;        // Estimated
}


// ************************************************************************* //
