OpenFOAM/case/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// FoamX Case Dictionary.

FoamFile
{
    version         2.0;
    format          ascii;

    root            "/home/gregor/FOAMProj/";
    case            "Wing";
    instance        "system";
    local           "";

    class           dictionary;
    object          fvSchemes;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         cellLimited Gauss linear 0;
    grad(turb)      cellLimited Gauss linear 1;
}

divSchemes
{
    default                       none;
    div(phi,U)                    bounded Gauss linearUpwind grad(U);
    div(phi,kt)                   bounded Gauss linearUpwind grad(turb);
    div(phi,kl)                   bounded Gauss linearUpwind grad(turb);
    div(phi,omega)                bounded Gauss linearUpwind grad(turb);
    div(phi,nuTilda)              bounded Gauss linearUpwind grad(U);
    div((nuEff*dev(grad(U).T()))) Gauss linear;
    div((nuEff*dev(T(grad(U)))))  Gauss linear;
}

laplacianSchemes
{
    default                        none;
    laplacian(nuEff,U)             Gauss linear corrected;
    laplacian((1|A(U)),p)          Gauss linear corrected;
    laplacian(DkEff,k)             Gauss linear corrected;
    laplacian(DomegaEff,omega)     Gauss linear corrected;
    laplacian(DREff,R)             Gauss linear corrected;
    laplacian(DnuTildaEff,nuTilda) Gauss linear corrected;
    laplacian(alphaTEff,kt)        Gauss linear corrected;
    laplacian(alphaTEff,kl)        Gauss linear corrected;
    laplacian(alphaTEff,omega)     Gauss linear corrected;
    laplacian(nu,kl)               Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p;
}



// ************************************************************************* //
